Delphisix/nrf52_cycling_power_sdk14/source/app_ble_nus_peripheral.c
        writePacketBuffer(p_evt->params.rx_data.p_data,p_evt->params.rx_data.length);
    }

}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
//static void services_init(void)
//{
//    uint32_t       err_code;
//    ble_nus_init_t nus_init;
//
//    memset(&nus_init, 0, sizeof(nus_init));
//
//    nus_init.data_handler = nus_data_handler;
//
//    err_code = ble_nus_init(&m_nus, &nus_init);
//    APP_ERROR_CHECK(err_code);
//}


///**@brief Function for handling an event from the Connection Parameters Module.
// *
// * @details This function will be called for all events in the Connection Parameters Module
// *          which are passed to the application.
// *
// * @note All this function does is to disconnect. This could have been done by simply setting
// *       the disconnect_on_fail config parameter, but instead we use the event handler
// *       mechanism to demonstrate its use.
// *
// * @param[in] p_evt  Event received from the Connection Parameters Module.
// */
//static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
//{
//    uint32_t err_code;
//
//    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
//    {
//        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
//        APP_ERROR_CHECK(err_code);
//    }
//}
//
//
///**@brief Function for handling errors from the Connection Parameters module.
// *
// * @param[in] nrf_error  Error code containing information about what went wrong.
// */
//static void conn_params_error_handler(uint32_t nrf_error)
//{
//    APP_ERROR_HANDLER(nrf_error);
//}
//
//
///**@brief Function for initializing the Connection Parameters module.
// */
//static void conn_params_init(void)
//{
//    uint32_t               err_code;
//    ble_conn_params_init_t cp_init;
//
//    memset(&cp_init, 0, sizeof(cp_init));
//
//    cp_init.p_conn_params                  = NULL;
//    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
//    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
//    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
//    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
//    cp_init.disconnect_on_fail             = false;
//    cp_init.evt_handler                    = on_conn_params_evt;
//    cp_init.error_handler                  = conn_params_error_handler;
//
//    err_code = ble_conn_params_init(&cp_init);
//    APP_ERROR_CHECK(err_code);
//}


///**@brief Function for putting the chip into sleep mode.
// *
// * @note This function will not return.
// */
//static void sleep_mode_enter(void)
//{
//    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//    APP_ERROR_CHECK(err_code);
//
//    // Prepare wakeup buttons.
//    err_code = bsp_btn_ble_sleep_mode_prepare();
//    APP_ERROR_CHECK(err_code);
//
//    // Go to system-off mode (this function will not return; wakeup will cause a reset).
//    err_code = sd_power_system_off();
//    APP_ERROR_CHECK(err_code);
//}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
//static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
//{
//    uint32_t err_code;
//
//    switch (ble_adv_evt)
//    {
//        case BLE_ADV_EVT_FAST:
//            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
//            APP_ERROR_CHECK(err_code);
//            break;
//        case BLE_ADV_EVT_IDLE:
//            //sleep_mode_enter();
//            break;
//        default:
//            break;
//    }
//}


///**@brief Function for handling BLE events.
// *
// * @param[in]   p_ble_evt   Bluetooth stack event.
// * @param[in]   p_context   Unused.
// */
//static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
//{
//    uint32_t err_code;
//
//    switch (p_ble_evt->header.evt_id)
//    {
//        case BLE_GAP_EVT_CONNECTED:
//            NRF_LOG_INFO("Connected");
//            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
//            APP_ERROR_CHECK(err_code);
//            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
//            break;
//
//        case BLE_GAP_EVT_DISCONNECTED:
//            NRF_LOG_INFO("Disconnected");
//            err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//            APP_ERROR_CHECK(err_code);
//            m_conn_handle = BLE_CONN_HANDLE_INVALID;
//            break;
//
//#if defined(S132)
//        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
//        {
//            NRF_LOG_DEBUG("PHY update request.");
//            ble_gap_phys_t const phys =
//            {
//                .rx_phys = BLE_GAP_PHY_AUTO,
//                .tx_phys = BLE_GAP_PHY_AUTO,
//            };
//            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
//            APP_ERROR_CHECK(err_code);
//        } break;
//#endif
//
//        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
//            // Pairing not supported
//            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
//            APP_ERROR_CHECK(err_code);
//            break;
//
//         case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
//        {
//            ble_gap_data_length_params_t dl_params;
//
//            // Clearing the struct will effectivly set members to @ref BLE_GAP_DATA_LENGTH_AUTO
//            memset(&dl_params, 0, sizeof(ble_gap_data_length_params_t));
//            err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
//            APP_ERROR_CHECK(err_code);
//        } break;
//
//        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
//            // No system attributes have been stored.
//            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
//            APP_ERROR_CHECK(err_code);
//            break;
//
//        case BLE_GATTC_EVT_TIMEOUT:
//            // Disconnect on GATT Client timeout event.
//            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
//                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//            APP_ERROR_CHECK(err_code);
//            break;
//
//        case BLE_GATTS_EVT_TIMEOUT:
//            // Disconnect on GATT Server timeout event.
//            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
//                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//            APP_ERROR_CHECK(err_code);
//            break;
//
//        case BLE_EVT_USER_MEM_REQUEST:
//            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
//            APP_ERROR_CHECK(err_code);
//            break;
//
//        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
//        {
//            ble_gatts_evt_rw_authorize_request_t  req;
//            ble_gatts_rw_authorize_reply_params_t auth_reply;
//
//            req = p_ble_evt->evt.gatts_evt.params.authorize_request;
//
//            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
//            {
//                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
//                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
//                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
//                {
//                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
//                    {
//                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
//                    }
//                    else
//                    {
//                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
//                    }
//                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
//                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
//                                                               &auth_reply);
//                    APP_ERROR_CHECK(err_code);
//                }
//            }
//        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST
//
//        default:
//            // No implementation needed.
//            break;
//    }
//}


///**@brief Function for the SoftDevice initialization.
// *
// * @details This function initializes the SoftDevice and the BLE event interrupt.
// */
//static void ble_stack_init(void)
//{
//    ret_code_t err_code;
//
//    if(!nrf_sdh_is_enabled()){
//      err_code = nrf_sdh_enable_request();
//      APP_ERROR_CHECK(err_code);
//    }
//    // Configure the BLE stack using the default settings.
//    // Fetch the start address of the application RAM.
//    uint32_t ram_start = 0;
//    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
//    APP_ERROR_CHECK(err_code);
//
//    // Enable BLE stack.
//    err_code = nrf_sdh_ble_enable(&ram_start);
//    APP_ERROR_CHECK(err_code);
//
//    // Register a handler for BLE events.
//    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
//}

//
///**@brief Function for handling events from the GATT library. */
//void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
//{
//    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
//    {
//        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
//        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
//    }
//    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
//                  p_gatt->att_mtu_desired_central,
//                  p_gatt->att_mtu_desired_periph);
//}
//
//
///**@brief Function for initializing the GATT library. */
//void gatt_init(void)
//{
//    ret_code_t err_code;
//
//    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
//    APP_ERROR_CHECK(err_code);
//
//    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, 64);
//    APP_ERROR_CHECK(err_code);
//}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
//void bsp_event_handler(bsp_event_t event)
//{
//    uint32_t err_code;
//    switch (event)
//    {
//        case BSP_EVENT_SLEEP:
//            sleep_mode_enter();
//            break;
//
//        case BSP_EVENT_DISCONNECT:
//            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//            if (err_code != NRF_ERROR_INVALID_STATE)
//            {
//                APP_ERROR_CHECK(err_code);
//            }
//            break;
//
//        case BSP_EVENT_WHITELIST_OFF:
//            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
//            {
//                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
//                if (err_code != NRF_ERROR_INVALID_STATE)
//                {
//                    APP_ERROR_CHECK(err_code);
//                }
//            }
//            break;
//
//        default:
//            break;
//    }
//}


