Delphisix/nrf52_cycling_power_sdk14/source/app_ble_nus_peripheral.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
//void uart_event_handle(app_uart_evt_t * p_event)
//{
//    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
//    static uint8_t index = 0;
//    uint32_t       err_code;
//
//    switch (p_event->evt_type)
//    {
//        case APP_UART_DATA_READY:
//            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
//            index++;
//
//            if ((data_array[index - 1] == '\n') || (index >= (m_ble_nus_max_data_len)))
//            {
//                NRF_LOG_DEBUG("Ready to send data over BLE NUS");
//                NRF_LOG_HEXDUMP_DEBUG(data_array, index);
//
//                do
//                {
//                    uint16_t length = (uint16_t)index;
//                    err_code = ble_nus_string_send(&m_nus, data_array, &length);
//                    if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_BUSY) )
//                    {
//                        APP_ERROR_CHECK(err_code);
//                    }
//                } while (err_code == NRF_ERROR_BUSY);
//
//                index = 0;
//            }
//            break;
//
//        case APP_UART_COMMUNICATION_ERROR:
//            APP_ERROR_HANDLER(p_event->data.error_communication);
//            break;
//
//        case APP_UART_FIFO_ERROR:
//            APP_ERROR_HANDLER(p_event->data.error_code);
//            break;
//
//        default:
//            break;
//    }
//}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
//static void uart_init(void)
//{
//    uint32_t                     err_code;
//    app_uart_comm_params_t const comm_params =
//    {
//        .rx_pin_no    = RX_PIN_NUMBER,
//        .tx_pin_no    = TX_PIN_NUMBER,
//        .rts_pin_no   = RTS_PIN_NUMBER,
//        .cts_pin_no   = CTS_PIN_NUMBER,
//        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
//        .use_parity   = false,
//        .baud_rate    = UART_BAUDRATE_BAUDRATE_Baud115200
//    };
//
//    APP_UART_FIFO_INIT(&comm_params,
//                       UART_RX_BUF_SIZE,
//                       UART_TX_BUF_SIZE,
//                       uart_event_handle,
//                       APP_IRQ_PRIORITY_LOWEST,
//                       err_code);
//    APP_ERROR_CHECK(err_code);
//}
/**@snippet [UART Initialization] */


///**@brief Function for initializing the Advertising functionality.
// */
//static void advertising_init(void)
//{
//    uint32_t               err_code;
//    ble_advertising_init_t init;
//
//    memset(&init, 0, sizeof(init));
//
//    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
//    init.advdata.include_appearance = false;
//    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
//
//    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
//    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;
//
//    init.config.ble_adv_fast_enabled  = true;
//    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
//    init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
//
//    init.evt_handler = on_adv_evt;
//
//    err_code = ble_advertising_init(&m_advertising, &init);
//    APP_ERROR_CHECK(err_code);
//
//    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
//}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
//static void buttons_leds_init(bool * p_erase_bonds)
//{
//    bsp_event_t startup_event;
//
//    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);
//
//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);
//
//    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
//}


/**@brief Function for initializing the nrf log module.
 */
//static void log_init(void)
//{
//    ret_code_t err_code = NRF_LOG_INIT(NULL);
//    APP_ERROR_CHECK(err_code);
//
//    NRF_LOG_DEFAULT_BACKENDS_INIT();
//}


/**@brief Function for placing the application in low power state while waiting for events.
 */
//static void power_manage(void)
//{
//    uint32_t err_code = sd_app_evt_wait();
//    APP_ERROR_CHECK(err_code);
//}




// PACKET HANDLE CODE START
#define REPORT_INTERVAL APP_TIMER_TICKS(100)
APP_TIMER_DEF(m_report_timer_id);
#define PACKET_BUFFER_SIZE      128
static uint8_t packet[PACKET_BUFFER_SIZE];
buffer_t pktBuf={packet,packet,packet,packet+PACKET_BUFFER_SIZE};

void report_timeout_handler(void *p_context)
{
  NRF_LOG_INFO(__func__);
  pktBuf.w += bmi160_cmd_singleshot(pktBuf.w);
  if(BUF_SIZE(pktBuf) > 100){
    uint16_t len = BUF_SIZE(pktBuf);
    buildPacketHeader(MASK_TYPE_DATA,0x0,packet,len);
    // put into nus buffer
    ble_nus_string_send(&m_nus,packet,&len);
    pktBuf.r = packet;
    pktBuf.w = (packet + CMD_STRUCT_SZ);
    NRF_LOG_INFO("Send data %d bytes",len);
  }
}

void handlePacket(uint8_t *b, uint8_t target)
{
  NRF_LOG_INFO(__func__);
  uint32_t err_code;
  cmd_header_t *header = (cmd_header_t*)b;
  switch(target){
    case CMD_HOST:{
//      NRF_LOG_INFO("HOst Command");
//      uint8_t cmd = header->pid & (~NOCRC_MASK);
//      switch(header->type){
//        case MASK_TYPE | CMD_TYPE_CONTROL:{
//          switch(cmd){
//            case CMD_PID_CONTROL_STOP:{
//              scan_stop();
//            }break;
//            case CMD_PID_CONTROL_SCAN:{
//              scan_start();
//            }break;
//          }
//        }break;
//        case MASK_TYPE | CMD_TYPE_SETUP:{
//          switch(cmd){
//          case CMD_PID_SETUP_CONNECT:{
//            if(m_ble_nus_c.conn_handle == BLE_CONN_HANDLE_INVALID){
//              ble_gap_addr_t adr;
//              memcpy((uint8_t*)adr.addr,(uint8_t*)(b+CMD_STRUCT_SZ),6);
//              adr.addr_id_peer = 0;
//              adr.addr_type = 1;
//              connect_to_dev(&adr);
//            }            
//            }break;
//          case CMD_PID_SETUP_DISCONNECT:{
//            disconnect_to_dev();
//            }break;
//          }
//        }break;
//      }
    }break;
    case CMD_DEVICE:{
      NRF_LOG_INFO("Device Command");
      uint8_t cmd = header->pid & (~NOCRC_MASK);
      switch(header->type){
        case MASK_TYPE | CMD_TYPE_CONTROL:{
          switch(cmd){
          case CMD_PID_CONTROL_DEV_STOP:
            NRF_LOG_INFO("Stop transfer");
            // todo : issue stop transfer
            err_code = app_timer_stop(m_report_timer_id);
            APP_ERROR_CHECK(err_code);
            break;
          case CMD_PID_CONTROL_DEV_START:
            NRF_LOG_INFO("Start transfer");
            // todo : issue start transfer
            pktBuf.r = pktBuf.s = packet;
            pktBuf.w = packet + CMD_STRUCT_SZ;
            pktBuf.e = packet + PACKET_BUFFER_SIZE;
            err_code = app_timer_start(m_report_timer_id,REPORT_INTERVAL,NULL);
            APP_ERROR_CHECK(err_code);
            break;
          }
        }break;
        case MASK_TYPE | CMD_TYPE_SETUP:{
          switch(cmd){
            
          }
        }break;
      }
    }break;
  }
  
}

// PACKET HANDLE CODE END


/**@brief Application main function.
 */
int app_ble_nus_init(void)
{
    uint32_t err_code;
    bool     erase_bonds;
    
    initPacket(handlePacket);

//    NRF_LOG_INFO("UART Start!");
    
    ble_nus_init_t nus_init;

    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_report_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                report_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

void app_ble_nus_start()
{
    uint32_t err_code;
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**
 * @}
 */
